In [1]:
import pandas as pd

In [2]:
# 열이름을 key, 리스트를 value로 갖는 dictionary (2차원 array)

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [3]:
# 리스트에 행 인덱스 열이름 지정해 데이터프레임 만들기
df = pd.DataFrame([[15, 'M','Sinchon'],[17, 'F','Yonsei']], 
                  index = ['James','Mary'],columns = ['age','sex','school'] )
df

       age sex   school
James   15   M  Sinchon
Mary    17   F   Yonsei

In [6]:
print(df.index)  # index name
print(df.columns)  # col name

Index(['James', 'Mary'], dtype='object')
Index(['age', 'sex', 'school'], dtype='object')

In [7]:
df.columns = ['나이','M/F','소속']   # column명 바꿔줌
df

       나이 M/F       소속
James  15   M  Sinchon
Mary   17   F   Yonsei

In [8]:
df.index = ['Student1', 'Student2']   #index명 바꿔줌
df

          나이 M/F       소속
Student1  15   M  Sinchon
Student2  17   F   Yonsei

In [9]:
# 메소드 사용해 행, 열이름 변경
df = pd.DataFrame([[15, 'M','Sinchon'],[17, 'F','Yonsei']], 
                  index = ['James','Mary'],columns = ['age','sex','school'] )
df.rename(columns = {'age':'how old','sex':'M/F','school':'L'}, inplace = True )   #inplace true는 값 자체를 바꾸는 것
df

       how old M/F        L
James       15   M  Sinchon
Mary        17   F   Yonsei

In [10]:
df.rename(index = {'James':'student1','Mary':'student2'}, inplace = True ) 
df

          how old M/F        L
student1       15   M  Sinchon
student2       17   F   Yonsei

In [11]:
data = {'kor':[80,90,70,30],'eng':[90,70,60,40],'math':[90,60,80,70]}
data

{'kor': [80, 90, 70, 30], 'eng': [90, 70, 60, 40], 'math': [90, 60, 80, 70]}

In [12]:
data_df = pd.DataFrame(data, index = ['춘향','몽룡','향단','방자'])
data_df

    kor  eng  math
춘향   80   90    90
몽룡   90   70    60
향단   70   60    80
방자   30   40    70

In [13]:
# 몽룡의 국어점수
data_df.iloc[0,1]

90

In [16]:
# 모든 국어점수
data_df.loc[:,'kor']

춘향    80
몽룡    90
향단    70
방자    30
Name: kor, dtype: int64

In [24]:
data_df.iloc[:,0]

춘향    80
몽룡    90
향단    70
방자    30
Name: kor, dtype: int64

In [17]:
data_df['kor']

춘향    80
몽룡    90
향단    70
방자    30
Name: kor, dtype: int64

In [19]:
import numpy as np
np.sort(data_df['kor'])

array([30, 70, 80, 90], dtype=int64)

In [28]:
np.argsort(data_df['kor'])

춘향    3
몽룡    2
향단    0
방자    1
Name: kor, dtype: int64

In [29]:
data_df['kor']['몽룡']   #열, 인덱스

90

In [30]:
import numpy as np
np.random.seed(2023)
d = pd.DataFrame(np.random.randint(60,100,12).reshape(4,3),
                 index = ['James','Maria','Brian','Alice'], 
                 columns = ['kor','eng','math'])
d

       kor  eng  math
James   83   85    66
Maria   93   88    63
Brian   82   97    92
Alice   82   77    73

#### Select row

In [34]:
%%writefile sample.csv
c1, c2, c3
1, 1.15, one
2, 2.23, two
3, 3.32, three

Overwriting sample.csv

In [35]:
# 파일 읽기
df = pd.read_csv('sample.csv')

In [36]:
df

   c1    c2      c3
0   1  1.15     one
1   2  2.23     two
2   3  3.32   three

In [37]:
df2 = df[:]   #copy명령 없이 복사

In [38]:
df2.drop(1,inplace=True)
df2

C:\Users\tjoeun\AppData\Local\Temp\ipykernel_8748\544197894.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(1,inplace=True)

   c1    c2      c3
0   1  1.15     one
2   3  3.32   three

In [40]:
df3 = pd.DataFrame(np.random.randint(60,100,12).reshape(4,3),
                 index = ['James','Maria','Brian','Alice'], 
                 columns = ['kor','eng','math'])
df3

       kor  eng  math
James   84   68    96
Maria   61   67    82
Brian   67   85    94
Alice   73   87    83

In [41]:
df3.drop('Brian',inplace=True)
df3

       kor  eng  math
James   84   68    96
Maria   61   67    82
Alice   73   87    83

In [44]:
df3.drop(columns = 'kor')

       eng  math
James   68    96
Maria   67    82
Alice   87    83

In [45]:
df3.drop(['Maria','Alice'],inplace=True)
df3

       kor  eng  math
James   84   68    96

In [46]:
df4 = pd.DataFrame(np.random.randint(60,100,16).reshape(4,-1),
                 index = ['James','Maria','Brian','Alice'], 
                 columns = ['kor','eng','math','music'])
df4

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [47]:
df5 = df4.copy()
df5

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [51]:
df5.drop('math',axis = 1, inplace = True)
df5

       kor  eng  music
James   94   98     94
Maria   71   61     65
Brian   79   65     65
Alice   70   67     66

In [52]:
df6 = df4.copy()
df6

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [53]:
df6.drop(['eng','music'], axis = 1, inplace = True)
df6

       kor  math
James   94    96
Maria   71    91
Brian   79    91
Alice   70    79

In [54]:
# select row

mar1 = df4.loc['Maria']   #location
mar1

kor      71
eng      61
math     91
music    65
Name: Maria, dtype: int32

In [55]:
mar2 = df4.iloc[1]   #index location
mar2

kor      71
eng      61
math     91
music    65
Name: Maria, dtype: int32

In [56]:
label1 = df4.loc[['Brian','Alice']]   #list형태로 반드시 넣어줘야 함
label1

       kor  eng  math  music
Brian   79   65    91     65
Alice   70   67    79     66

In [57]:
label22 = df4.iloc[[2,3]]
label22

       kor  eng  math  music
Brian   79   65    91     65
Alice   70   67    79     66

In [58]:
label2 = df4.iloc[2:,]
label2

       kor  eng  math  music
Brian   79   65    91     65
Alice   70   67    79     66

In [59]:
label3 = df4.loc[['Maria','Brian']]
label33 = df4.loc['Maria':'Brian']
print(label3)
print(label33)

       kor  eng  math  music
Maria   71   61    91     65
Brian   79   65    91     65
       kor  eng  math  music
Maria   71   61    91     65
Brian   79   65    91     65

In [60]:
label4 = df4.iloc[[1,2]]
label44 = df4.iloc[1:3]
print(label4)
print(label44)

       kor  eng  math  music
Maria   71   61    91     65
Brian   79   65    91     65
       kor  eng  math  music
Maria   71   61    91     65
Brian   79   65    91     65

#### Select Columns

In [67]:
df4

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [66]:
math1 = df4['math']
print(type(math1))
print(math1)

<class 'pandas.core.series.Series'>
James    96
Maria    91
Brian    91
Alice    79
Name: math, dtype: int32

In [68]:
eng1 = df4.eng   # 하나만 가져올 수 있음
eng1

James    98
Maria    61
Brian    65
Alice    67
Name: eng, dtype: int32

In [72]:
math_music = df4[['math','music']]
print(type(math_music))
print(math_music)

<class 'pandas.core.frame.DataFrame'>
       math  music
James    96     94
Maria    91     65
Brian    91     65
Alice    79     66

In [73]:
math2 = df4['math']    # series 로 가져옴
print(type(math2))
print(math2)

<class 'pandas.core.series.Series'>
James    96
Maria    91
Brian    91
Alice    79
Name: math, dtype: int32

In [74]:
math22 = df4[['math']]    # dataframe으로 가져옴
print(type(math22))
print(math22)

<class 'pandas.core.frame.DataFrame'>
       math
James    96
Maria    91
Brian    91
Alice    79

#### Select elements

In [75]:
df4

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [77]:
# Maria의 음악점수 가져오기
df4.iloc[1,3]

65

In [79]:
df4.loc['Maria']['music']

65

In [81]:
df4.loc['Maria','music']

65

In [91]:
# Maria의 영어, 수학점수 가져오기
df4.iloc[1,1:3]

eng     61
math    91
Name: Maria, dtype: int32

In [83]:
df4.loc['Maria',['eng','math']]

eng     61
math    91
Name: Maria, dtype: int32

In [92]:
df4.iloc[1,[1,2]]

eng     61
math    91
Name: Maria, dtype: int32

In [93]:
# James, eng, math, music, iloc 사용 / loc 사용
df4.iloc[0,1:]

eng      98
math     96
music    94
Name: James, dtype: int32

In [96]:
df4.iloc[0,[1,2,3]]

eng      98
math     96
music    94
Name: James, dtype: int32

In [97]:
df4.loc['James',['eng','math','music']]

eng      98
math     96
music    94
Name: James, dtype: int32

In [104]:
df4.loc['James','eng':'music']

eng      98
math     96
music    94
Name: James, dtype: int32

In [98]:
# Maria~Alice, eng~music 가져오기, iloc/loc 사용
df4

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [100]:
df4.loc[['Maria','Brian','Alice'],['eng','math','music']]

       eng  math  music
Maria   61    91     65
Brian   65    91     65
Alice   67    79     66

In [105]:
df4.loc['Maria':'Alice','eng':'music']

       eng  math  music
Maria   61    91     65
Brian   65    91     65
Alice   67    79     66

In [102]:
df4.iloc[1:,1:]

       eng  math  music
Maria   61    91     65
Brian   65    91     65
Alice   67    79     66

In [103]:
df4.iloc[[1,3],1:]

       eng  math  music
Maria   61    91     65
Alice   67    79     66

#### Add rows & columns

In [106]:
df4

       kor  eng  math  music
James   94   98    96     94
Maria   71   61    91     65
Brian   79   65    91     65
Alice   70   67    79     66

In [108]:
df4['pe']= 90
df4.loc[4] = 0
df4

       kor  eng  math  music  pe
James   94   98    96     94  90
Maria   71   61    91     65  90
Brian   79   65    91     65  90
Alice   70   67    79     66  90
4        0    0     0      0   0

In [110]:
df4.loc['George'] = [90, 70, 60, 75, 60]
df4

        kor  eng  math  music  pe
James    94   98    96     94  90
Maria    71   61    91     65  90
Brian    79   65    91     65  90
Alice    70   67    79     66  90
4        90   70    60     75  60
George   90   70    60     75  60

In [115]:
df4.drop(4, axis = 0, inplace=True)

In [116]:
df4

        kor  eng  math  music  pe
James    94   98    96     94  90
Maria    71   61    91     65  90
Brian    79   65    91     65  90
Alice    70   67    79     66  90
George   90   70    60     75  60

In [121]:
# 중간에 row 삽입하는 방법
# 1.reindex
# 2.concat iloc
# 3.insert

### Set Index

In [131]:
# set_index
exam_data = {'name':['Gildong','Cheol','Younghee'],
            'math':[90,80,70],'eng':[98,89,95],
            'music':[85,95,100],'phy':[100,90,90]}
exam_data

{'name': ['Gildong', 'Cheol', 'Younghee'],
 'math': [90, 80, 70],
 'eng': [98, 89, 95],
 'music': [85, 95, 100],
 'phy': [100, 90, 90]}

In [132]:
df = pd.DataFrame(exam_data)
df

       name  math  eng  music  phy
0   Gildong    90   98     85  100
1     Cheol    80   89     95   90
2  Younghee    70   95    100   90

In [133]:
# 열 자체를 index명으로 지정
df.set_index('name', inplace=True)
df

          math  eng  music  phy
name
Gildong     90   98     85  100
Cheol       80   89     95   90
Younghee    70   95    100   90

In [134]:
#Gildong, phy
df.iloc[0,3]

100

In [135]:
df.loc['Gildong','phy']

100

In [136]:
#Gildong, phy 90점으로 수정
df.iloc[0,3] = 90
df

          math  eng  music  phy
name
Gildong     90   98     85   90
Cheol       80   89     95   90
Younghee    70   95    100   90

In [139]:
# Cheol, music, phy을 50점으로 변경
df.iloc[[1,1],[2,3]] = [50,50]
df

          math  eng  music  phy
name
Gildong     90   98     85   90
Cheol       80   90     50   50
Younghee    70   90    100   90

In [144]:
df.loc['Cheol',['music','phy']] = 50
df

          math  eng  music  phy
name
Gildong     90   98     85   90
Cheol       80   90     50   50
Younghee    70   90    100   90

In [142]:
# Cheol, music, phy을 100, 50점으로 변경
df.iloc[1,2] = 100
df

          math  eng  music  phy
name
Gildong     90   98     85   90
Cheol       80   90    100   50
Younghee    70   90    100   90

In [145]:
df.loc['Cheol',['music','phy']] = 100, 50
df

          math  eng  music  phy
name
Gildong     90   98     85   90
Cheol       80   90    100   50
Younghee    70   90    100   90

In [152]:
# set_index 
exam_data = {'name':['Gildong','Cheol','Younghee'],
            'math':[90,80,70],'eng':[98,89,95],
            'music':[85,95,100],'phy':[100,90,90]}
df = pd.DataFrame(exam_data)
df

       name  math  eng  music  phy
0   Gildong    90   98     85  100
1     Cheol    80   89     95   90
2  Younghee    70   95    100   90

In [154]:
ndf = df.set_index(['name'])
ndf

          math  eng  music  phy
name
Gildong     90   98     85  100
Cheol       80   89     95   90
Younghee    70   95    100   90

In [155]:
ndf = df.set_index(['music'])
ndf

           name  math  eng  phy
music
85      Gildong    90   98  100
95        Cheol    80   89   90
100    Younghee    70   95   90

In [156]:
ndf = df.set_index(['math','music'])
ndf

                name  eng  phy
math music
90   85      Gildong   98  100
80   95        Cheol   89   90
70   100    Younghee   95   90

### Transpose

In [146]:
df.transpose()

name   Gildong  Cheol  Younghee
math        90     80        70
eng         98     90        90
music       85    100       100
phy         90     50        90

In [147]:
df.T

name   Gildong  Cheol  Younghee
math        90     80        70
eng         98     90        90
music       85    100       100
phy         90     50        90

### Reindex

In [157]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [158]:
df = pd.DataFrame(dict_data, index = ['r0','r1','r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [162]:
# index 지정해서 새로 행추가
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [164]:
# reindex로 0으로 채우기
ndf2 = df.reindex(new_index, fill_value = 0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [165]:
# reset_index 
ndf2 = ndf2.reset_index()
ndf2

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15
3    r3   0   0   0   0   0
4    r4   0   0   0   0   0

### sort

In [168]:
# 내림차순으로 행인덱스 정렬
ndf2 = ndf2.sort_index(ascending = False)
print(ndf2)

  index  c0  c1  c2  c3  c4
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13

In [171]:
# 열 c1기준, 내림차순
ndf3 = ndf2.sort_values(by= 'c1', ascending = False)
ndf3

  index  c0  c1  c2  c3  c4
2    r2   3   6   9  12  15
1    r1   2   5   8  11  14
0    r0   1   4   7  10  13
4    r4   0   0   0   0   0
3    r3   0   0   0   0   0

### Series 숫자계산